[{"title":"Brute Force Basic Authentication","description":"This challenge contains a vulnerability in which the admin password is considered weak. The challenge is to gain access to the administrator account to retreive the flag. For this challenge you can use the following user name/password of a standard user user1/userpassword1.","difficulty":"Easy","challenge_type":"authentication"},
{"title":"Unverified JWT Signature","description":"This challenge contains a vulnerability in which the JWT signature is not being verified. The challenge is to elevate your privileges to the admin user and submit the flag. For this challenge you can use the following user name/password of a standard user user1/userpassword1","difficulty":"Intermediate","challenge_type":"authentication"},
{"title":"Weak JWT Secret","description":"This challenge contains a vulnerability in which the JWT secret is weak. The challenge is to elevate your privileges to the admin user and submit the flag. The signature in this challenge is being verified so the previous exploit will not work. For this challenge you can use the following username and password of a standard user: user1/userpassword1. Addtionally the secret is no greater than 6 characters and only contains lowercase letters.","difficulty":"Intermediate","challenge_type":"authentication"},
{"title":"Broken Object Level Authorization 1","description":"This challenge contains an authorization vulnerability. The challenge is to return the admin account information by modifying an object identifier. For this challenge you can use the following username and password of a standard user: user1/userpassword1","difficulty":"Easy","challenge_type":"authorization"},
{"title":"Broken Object Level Authorization 2","description":"This challenge is similar to Broken Object Level Authorization 1 in which there is an authorization vulnerability but is considered harder. Keep an eye on the headers of the request. The challenge is to gain access to the admin users account information to obtain the flag. For this challenge you can use the following user name/password of a standard user user1/userpassword1.","difficulty":"Intermediate","challenge_type":"authorization"},
{"title":"Broken Function Level Authorization","description":"In this challenge there is are several administrator endpoints accessible without proper authorziation controls. For this challenge you need to discover the endpoints and elevate your role to admin. For this challenge you can use the following user name/password of a standard user user1/userpassword1.","difficulty":"Hard","challenge_type":"authorization"},
{"title":"Mass Assignment","description":"This challenge contains a mass assignment vulnerability. The challenge is to elevate your privileges to the admin user and submit the flag. For this challenge you can use the following username and password of a standard user: user1/userpassword1","difficulty":"Hard","challenge_type":"massassignment"}]